Documents/УтверждениеГрафикаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>УтверждениеГрафикаРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикиРаботы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочийГрафик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УтверждениеГрафикаРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Пятидневка(Команда)
	График = 5; 
	СформироватьГрафик(График);
КонецПроцедуры

&НаКлиенте
Процедура Шестидневка(Команда)
	График = 6; 
	СформироватьГрафик(График);
КонецПроцедуры


&НаКлиенте
Процедура СформироватьГрафик(График)
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.РабочийГрафик.Очистить();
	
	ДеньГрафика = НачалоГода(Объект.Дата);
	
	Пока ДеньГрафика <= КонецГода(Объект.Дата) Цикл
		
		НовЗн = Объект.РабочийГрафик.Добавить();
		НовЗн.День = ДеньГрафика;
		
		//Не оптимально
		//Если График = 5 Тогда
		//	Если ДеньНедели(ДеньГрафика) <= 5 Тогда
		//		НовЗн.Значение = 1;
		//	Иначе
		//		НовЗн.Значение = 0;
		//	КонецЕсли;
		//ИначеЕсли График = 6 Тогда
		//	Если ДеньНедели(ДеньГрафика) <= 6 Тогда
		//		НовЗн.Значение = 1;
		//	Иначе
		//		НовЗн.Значение = 0;
		//	КонецЕсли;
		//КонецЕсли;  
		
		//Оптимизированный вариант
		Если ДеньНедели(ДеньГрафика) <= График Тогда
			НовЗн.Значение = 1;
		Иначе
			НовЗн.Значение = 0;
		КонецЕсли;
			
		
		ДеньГрафика = ДеньГрафика + 60 * 60 * 24;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры
